{
  "about": [
    "finance",
    "vocabulary"
  ],
  "description": "The LKIF core legal ontology consists of 15 modules, each of which describes a set of closely related concepts from both legal and commonsense domains.  In that sense, the LKIF core ontology is rather a library of ontologies relevant for the legal domain than a monolithic body of definitions.  A glossary of the concepts and properties included in these modules can be found here.  The online documentation provides a definition of each concept and property in the Manchester OWL syntax (See the co-ode website).\n\n# Abstract Concepts\n\nThe most abstract concepts are defined in five closely related modules: top, place, mereology, time and spacetime.\n- **top** The LKIF top ontology is largely based on the top-level of LRI-Core but has less ontological commitment in the sense that it imposes less restrictions on subclasses of the top categories.\n- **place** The place module partially implements the theory of relative places (Donnelly, 2005) in OWL DL.\n- **mereology** The mereology module defines mereological concepts such as parts and wholes, and typical mereological relations such as part of, component of, containment, membership etc.\n- **time** The time module provides an OWL DL implementation of the theory of time by Allen (1984).\n\n# Basic Concepts\n\nBasic-level concepts are distributed across four modules: process, role, action and expression.\n- **process** The process module extends the LKIF top ontology module with a definition of changes, processes (being causal changes) and physical objects.  It introduces a limited set of properties for describing participant roles of processes.\n- **role** The role module defines a typology of roles (epistemic roles, functions, person roles, organisation roles) and the plays-property for relating a role filler to a role.\n- **action** The action module describes the vocabulary for representing actions in general.  Actions are processes which are performed by some agent (the actor of the action).  This module does not commit itself to a particular theory on thematic roles.\n- **expression** The expression module describes a vocabulary for describing, propositions and propositional attitudes (belief, intention), qualifications, statements and media.  It furthermore extends the role module with a number or epistemic roles, and is the basis for the definition of norms.\n\n# Legal Concepts\n\nThese basic clusters are extended by three modules that form the legal ontology: legal action, legal role and norm.\n- **legal-action** The legal action module extends the action module with a number of legal concepts related to action and agent, such as public acts, public bodies, legal person, natural person etc.\n- **legal-role** The legal role module extends the role module with a small number of legal concepts related to roles, legal professions etc.\n- **norm** The norm module is an extension primarily on the expression module where norms are defined as qualifications.  Please refer to Deliverable 1.1 for a more in-depth description of the underlying theory.  It furthermore defines a number of legal sources, e.g. legal documents, customary law etc., and a typology of rights and powers, cf. Sartor (2006), Rubino et al. (2006)\n\n# Framework Modules\n\nIn addition to these legal clusters, two modules are provided that cover the basic vocabulary of two frameworks: modification and rules.\n- **modification** The modification module is both an extension of the time module and the legal action module.  The time module is extended with numerous intervals and moments describing the efficacy and being in force of legal documents.  The action module is extended with a typology of modifications.  These concepts are described in further detail in Deliverable 3.2 of the ESTRELLA project.\n- **rules** The rules & argumentation module defines roles central to argumentation, and describes the vocabulary for LKIF rules as defined in Deliverable 1.1, chapter 5.  The module leaves room for further extension to complex argumentation frameworks (AIF, Carneades).\n\n# Core and Extended Ontology\n\nFinally, the twelve modules of the abstract, basic and legal level are integrated in the LKIF-Core ontology module.  This module does not provide any additional definitions, but functions as an entry-point for users of the ontology library.  The two framework modules are accessible through the LKIF Extended ontology module.  This module imports the LKIF Core module.",
  "homepage": "https://github.com/RinkeHoekstra/lkif-core",
  "id": "estrella/lkif@1.1",
  "image": "lkif.png",
  "license": "https://www.gnu.org/licenses/lgpl-3.0.html",
  "name": "LKIF-Core Ontology",
  "url": [
    "https://raw.githubusercontent.com/RinkeHoekstra/lkif-core/master/action.owl",
    "https://raw.githubusercontent.com/RinkeHoekstra/lkif-core/master/expression.owl",
    "https://raw.githubusercontent.com/RinkeHoekstra/lkif-core/master/legal-action.owl",
    "https://raw.githubusercontent.com/RinkeHoekstra/lkif-core/master/legal-role.owl",
    "https://raw.githubusercontent.com/RinkeHoekstra/lkif-core/master/lkif-core.owl",
    "https://raw.githubusercontent.com/RinkeHoekstra/lkif-core/master/lkif-extended.owl",
    "https://raw.githubusercontent.com/RinkeHoekstra/lkif-core/master/lkif-rules.owl",
    "https://raw.githubusercontent.com/RinkeHoekstra/lkif-core/master/lkif-top.owl",
    "https://raw.githubusercontent.com/RinkeHoekstra/lkif-core/master/mereology.owl",
    "https://raw.githubusercontent.com/RinkeHoekstra/lkif-core/master/norm.owl",
    "https://raw.githubusercontent.com/RinkeHoekstra/lkif-core/master/process.owl",
    "https://raw.githubusercontent.com/RinkeHoekstra/lkif-core/master/relative-places.owl",
    "https://raw.githubusercontent.com/RinkeHoekstra/lkif-core/master/role.owl",
    "https://raw.githubusercontent.com/RinkeHoekstra/lkif-core/master/time-modification.owl",
    "https://raw.githubusercontent.com/RinkeHoekstra/lkif-core/master/time.owl"
  ]
}
