{
  "about": [
    "language",
    "vocabulary"
  ],
  "description": "The Code List for Cultural Heritage Organizations contains short alphabetic codes used to represent names of libraries and other kinds of organizations that need to be identified in the bibliographic environment.  This code list is an essential reference tool for those dealing with MARC records, for systems reporting library holdings, for many interlibrary loan systems, and for those who may be organizing cooperative projects on a regional, national, or international scale.  There are a number of data elements in the MARC formats that call for institutional identifiers, the chief ones being those that identify the organization assigning the record control number, the agency responsible for creating or modifying a record, and the agency holding a copy of the item.  In particular, this list is a key to codes for holding institutions represented in the Library of Congress National Union Catalog (NUC) and other union list publications which contain holdings for reporting institutions.  This code list for cultural heritage organizations , which was begun in 1932 as part of a community project, includes new codes assigned on an on-going basis.  Over time, a small number of existing codes have been changed or made obsolete.  In all cases, previously valid codes are given as references.  The large number of codes can be attributed to continuing expansion of the use of standard identifiers, nationally by school libraries (particularly for statewide projects) and internationally as information is shared globally via the Internet.  While this list of organizations focuses on US institutions, with over 30,000 defined, it also includes codes for institutions in other countries that have requested them.  However, MARC codes are not assigned for institutions for Canada, Germany, or the United Kingdom unless the institution is a branch of a US institution.  The list contains over 41,000 entries.",
  "homepage": "http://id.loc.gov/vocabulary/organizations.html",
  "id": "loc/organizations",
  "name": "Code List for Cultural Heritage Organizations",
  "prefix": {
    "organization": "http://id.loc.gov/vocabulary/organizations/"
  },
  "url": "http://id.loc.gov/static/data/downloads/vocabularyorganizations.nt.skos.zip"
}
