{
  "about": [
    "bibliography",
    "vocabulary"
  ],
  "description": "The BIO vocabulary contains terms useful for finding out more about people and their backgrounds and has some cross-over into genealogical information.  The approach taken is to describe a person's life as a series of interconnected key events, around which other information can be woven.  This vocabulary defines the event framework and supplies a set of core event types that cover many use cases, but it is expected that it will be extended in other vocabularies to suit their needs.  The intention of this vocabulary is to describe biographical events of people and this intention carries through to the definitions of the properties and classes which are person-centric rather than neutral.  For example the Employment event puts the person being employed as the principal agent in the event rather than the employer.\n\nAt its heart the BIO vocabulary is concerned with people, their relationships and the events in their lives.  Together these can be used to build up a narrative of a person's life and their interactions with other people, organizations and the world around them.  Events bound intervals of time that may be associated with particular relationships between people and groups or organisations.  Many different types of life event are defined in this vocabulary including the obvious Birth, Marriage and Death but also Coronation, Performance and even Murder.  These events are not intended to be fully comprehensive but are representative of the types of events associated with biographical material.  Currently the relationship segment of the vocabulary is underspecified with only a generic Relationship class available.  It is envisaged that many types of relationship such as families, employments and ownerships will be specified in the future.\n\nThe sequence of events and intervals build a timeline of history against which people and their relationships can be placed.  The aim is to enable simple forms of genealogical reasoning such as determining whether a child was born out of wedlock or the location of a family given the fact one of their children was attending a particular school.  Events are ordered in time by relating them to one another and to abstract intervals of time.",
  "homepage": "https://vocab.org/bio/",
  "id": "bio@0.1",
  "name": "BIO",
  "prefix": {
    "bio": "http://purl.org/vocab/bio/0.1/"
  },
  "url": "https://vocab.org/bio/schema.rdf"
}
