{
  "about": [
    "reasoning",
    "vocabulary"
  ],
  "description": "The SPIN Modeling Vocabulary is a light-weight collection of RDF properties and classes to support the use of SPARQL to specify rules and logical constraints.  Based on an RDF representation of SPARQL queries, SPIN defines three class description properties: `spin:constraint` can be used to define conditions that all members of a class must fulfill.  `spin:rule` can be used to specify inference rules using SPARQL CONSTRUCTs and DELETE/INSERTs.  `spin:constructor` can be used to initialize new instances with default values.  In addition to these class description properties, SPIN provides a powerful meta-modeling capability that can be used to build your own modeling language and SPARQL extensions.  These meta-modeling features provide the ability to encapsulate reusable SPARQL queries into templates, and to derive new SPARQL functions as well as magic properties from other SPARQL queries and functions.\n\nSPIN has originally evolved as a specification developed by [TopQuadrant](/top-quadrant).  As of February 2011, SPIN has been published by [W3C](/w3c) as a member submission.  TopQuadrant may continue to improve SPIN in the future and make changes that will be published here.  As of July 2014, this version is almost identical to the official W3C submission, except that we have lifted the requirement of using the SPIN RDF syntax for the definition of queries and update commands if (and only if) `sp:text` triples are present.  Accordingly, we have changed the RDF source code of some examples to make them easier to read.  Another change in June 2013 (with TopBraid 4.3) was the addition of the concept of (optional) column metadata attached to SPIN templates.  The version of July 2014 (with TopBraid 4.5) has introduced the concept of union templates, and the built-in SPARQL functions `spin:ask`, `spin:construct` and `spin:select`.  The August 2014 version added constraint violation levels.  The November 2014 version introduced syntactic sugar on ASK constraints.",
  "homepage": "https://spinrdf.org/spin.html",
  "id": "top-quadrant/spin@2014-11-07",
  "name": "SPIN: Modeling Vocabulary",
  "prefix": {
    "spin": "http://spinrdf.org/spin#"
  },
  "url": "http://spinrdf.org/spin"
}
