{
  "description": "The European project for Standardized Transparent Representations in order to Extend Legal Accessibility (Estrella, IST-2004-027655) aims to develop and validate an open, standards-based platform allowing public administrations to develop and deploy comprehensive legal knowledge management solutions, without becoming dependent on proprietary products of particular vendors. Estrella will support, in an integrated way, both legal document management and legal knowledge-based systems, to provide a complete solution for improving the quality and efficiency of the determinative processes of public administration requiring the application of complex legislation and other legal sources. Estrella will facilitate a market of interoperable components for legal knowledge-based systems, allowing public administrations and other users to freely choose among competing development environments, inference engines, and other tools.\n\nThe main technical objectives of the Estrella project are to develop a Legal Knowledge Interchange Format ([LKIF](http://www.estrellaproject.org/?page_id=5)), building upon emerging XML-based standards of the Semantic Web, including [RDF](http://www.w3.org/RDF/) and [OWL](http://www.w3.org/2004/OWL/), and Application Programmer Interfaces (APIs) for interacting with legal knowledge-based systems. To achieve and demonstrate vendor neutrality and independence, translators between the [LKIF](http://www.estrellaproject.org/?page_id=5) format and the existing proprietary formats of LKBS vendors participating in the project will be developed.\n\nTo demonstrate and validate the Estrella platform, European tax related legislation and national tax legislation of two European countries will be modelled and used in the pilot applications. The finance ministries or tax administrations of several other European countries will take part in an Observatory Board to ensure generality of the approach.\n\nMore information available in the [2006](http://www.estrellaproject.org/?page_id=96), [2007](http://www.estrellaproject.org/?page_id=99) and [2008](http://www.estrellaproject.org/?page_id=100) periodic activity reports.",
  "homepage": "http://www.estrellaproject.org",
  "id": "estrella",
  "image": "estrella.png",
  "name": "Estrella"
}
