{
  "description": "The Open Biological and Biomedical Ontology (OBO) Foundry is a collective of ontology developers that are committed to collaboration and adherence to shared principles.  The mission of the OBO Foundry is to develop a family of interoperable ontologies that are both logically well-formed and scientifically accurate.  To achieve this, OBO Foundry participants voluntarily adhere to and contribute to the development of an evolving set of principles including [open use](http://obofoundry.org/principles/fp-001-open.html), [collaborative development](http://obofoundry.org/principles/fp-010-collaboration.html), [non-overlapping and strictly-scoped content](http://obofoundry.org/principles/fp-005-delineated-content.html), and common [syntax](http://obofoundry.org/principles/fp-002-format.html) and [relations](http://obofoundry.org/principles/fp-007-relations.html), based on ontology models that work well, such as the Gene Ontology (GO).\n\nThe OBO Foundry is overseen by an Operations Committee with [Editorial](http://obofoundry.org/docs/EditorialWG.html), [Technical](http://obofoundry.org/docs/TechnicalWG.html) and [Outreach](http://obofoundry.org/docs/OutreachWG.html) working groups.  The processes of the Editorial working group are modelled on the journal refereeing process.  A complete treatment of the OBO Foundry is given in [*The OBO Foundry: coordinated evolution of ontologies to support biomedical data integration*](http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2814061/).\n\nOn this site you will find a table of ontologies, available in several formats, with details for each, and documentation on [OBO Principles](http://obofoundry.org/principles/fp-000-summary.html).\n\nYou can contribute to this site using GitHub [OBOFoundry/OBOFoundry.github.io](https://github.com/OBOFoundry/OBOFoundry.github.io) or get in touch with us by joining our mail list <https://groups.google.com/forum/#!forum/obo-discuss>.",
  "homepage": "http://www.obofoundry.org/",
  "id": "obo",
  "image": "obo.png",
  "name": "Open Biological and Biomedical Ontology (OBO) Foundry"
}
